clc;
close all;
clear all;
%n为序列图像中病灶最明显的层数
n=[41,48,24,45,43,38,71,46,50,31,...
24,42,44,36,52,56,48,15,40,25,...
41,37,15,40,24,23,42,39,37,45,...
35,37,55,30,56,50,39,56,46,34,...
57,27,37,29,35,45,30,54,43,53,...
47,50,44,25,49,33,40,35,16,31,...
38,36,34,46,50,49,33,36,28,48,...
47,41,34,66,49,55,25,53,36,100,...
43,27,44,26,39,42,44,32,32,48,...
30,45,50,38,49,60,28,44,44,46,...
40,51,40,40,52,51,42,26,33,40,....
48,35,36,37,44,55,27,54,48,45,...
47];
%指定xxc1以上为胸廓区域
xxc1=[520,550,536,526,520,485,366,502,524,410,...
520,482,524,528,518,518,478,526,514,502,...
476,520,498,484,444,522,518,454,452,464,...
484,532,506,504,482,494,520,440,536,530,...
498,496,440,518,526,476,460,434,530,492,...
518,526,528,456,414,530,450,552,534,495,...
510,460,518,530,460,466,472,476,506,448,...
512,494,530,478,420,436,604,516,506,542,...
446,530,430,462,530,464,536,450,454,528,...
448,542,568,462,504,640,522,470,450,454,...
530,504,520,458,536,440,528,520,464,502,...
462,468,484,438,446,446,460,440,524,518,...
524];
%人工确认的种子点，自动分割不好时使用
x1=[625,616,623,544,598,584,400,566,557,551,...
    631,523,713,626,643,602,505,719,532,575,...
    527,641,551,560,547,623,530,590,709,510,...
    569,767,574,571,496,513,610,530,613,571,...
    530,505,598,530,617,517,560,479,610,577,...
    655,670,604,515,479,667,661,673,628,519,...
    661,581,595,625,540,483,573,583,579,517,...
    541,587,627,529,0,467,629,601,521,567,...
    593,617,0,531,673,493,783,571,603,733,...
    515,675,635,613,702,655,547,545,513,575,...
    583,733,566,469,551,453,553,603,519,569,...
    525,727,530,453,591,469,533,455,537,561,...
    595];
y1=[312,345,689,758,707,360,171,372,264,761,...
    328,274,337,775,322,677,366,354,303,710,...
    285,734,803,319,348,697,752,318,337,640,...
    309,267,325,186,271,745,321,334,767,743,...
    321,782,327,291,313,728,333,332,664,320,...
    788,343,746,340,779,682,304,354,338,734,...
    716,734,746,653,288,267,646,330,762,256,...
    354,286,298,714,0,674,678,254,768,718,...
    740,694,0,752,340,268,324,278,738,736,...
    673,728,326,675,685,772,774,714,772,358,...
    658,288,301,254,354,750,770,746,754,712,...
    684,286,309,252,230,692,374,770,672,634,...
    692];
for p=1%patient
    manual=1;%manual置1时人工指定生长点，否则自动确认
  n0=n(p);
for i1=-6:6%以病灶最明显层为中心取13张图片
    n1=n0+i1;
if ismember(p,[ 69,71,83,91,93,95,98,106,112,116,118])
                fileform =[ 'H:\乳腺病例\分类\DCE\',num2str(p),'\*.dcm'];
filepathsrc = ['H:\乳腺病例\分类\DCE\',num2str(p),'\'];
file_outord = dir(fileform);
c1=struct2cell(file_outord);
c2=c1{1,n1};
I = dicomread([filepathsrc,c2]);
elseif ismember(p,[ 75,80,92,96,102])
    seq=1;
I = dicomread(['H:\乳腺病例\分类\DCE\',num2str(p),'\',num2str(n1),'_',num2str((9*(n1-k(p)*seq-1))+(seq)),'.dcm']);
I=imresize(imrotate(I,180),[1024,1024]);
else
    try
    I = dicomread(['H:\乳腺病例\分类\DCE\',num2str(p),'\',num2str(n1),'_',num2str(n1-1),'.dcm']);%读取图像 
    catch
     I1 = dicomread(['H:\乳腺病例\分类\MASK\',num2str(p),'\',num2str(n0+i1),'_',num2str(n0+i1-1),'.dcm']);%读取图像 
     I2 = dicomread(['H:\乳腺病例\分类\Subtraction\',num2str(p),'\',num2str(n1),'_',num2str(n1-1),'.dcm']);%读取图像 
     I=I1+I2;
    end
end
[M,N]=size(I);
I=histeq1(I);%直方图均衡
I =double(I);
m_fil=5;sigma=0.1;
H=fspecial('gaussian',[m_fil m_fil],sigma);
I=imfilter(I,H,'same');%高斯滤波
I3(:,:,i1+7)=I;%待分割的原始3维图像1024*1024*13
end
%去除胸廓
xc=xxc1(p);
I3(1:xc,:)=0;

Ibreast=I3;
[m n z]=size(Ibreast);
initPos=[];
if manual~=1%自动确定生长点
%kmeans聚类
cluster=10;%聚为10类
y=floor(I3(:));
[Idx,x]=kmeans(y,cluster);
X=reshape(Idx,[m n z]);%聚类结果
 MEAN=[];
 %保留灰度均值最大的区域
for i=1:cluster
   Xi=X;
   Xi(Xi~=i)=0;
   Xi(Xi==i)=1;
   area=sum(Xi(:));       
   Xim=immultiply(I3,Xi);
   Mask=Xim(logical(Xim));
   if area<1000
       Mask=0;%去除面积过小的区域
   end
   MEAN(i)=mean(Mask(:));  
end
[a1,a2]=max(MEAN);
X(X~=a2)=0;
X(X==a2)=1;
 [bwlab,num]=bwlabeln(X);
 S= regionprops(bwlab, 'Area');
 bw1= ismember(bwlab, find([S.Area] == (max([S.Area]))));
     se=strel('disk',5);
 bw1=imclose(bw1,se);
 bw1=imfill(bw1,'hole');
cen=regionprops(bw1, 'Centroid');
initPos1= round(cen.Centroid);
initPos=[initPos1(2),initPos1(1),initPos1(3)]  ;
end
%使用人工确认好的点（initPos为[]则可手动取点）
%initPos=[x1(p),y1(p),7];
initPos=[];
I3(I3==0)=nan;
thresVal=(max(I3(:))-min(I3(:)))*0.15;%生长阈值取图像灰度范围的x%，可调
[Igrow_p] = regionGrowing(Ibreast,initPos, thresVal);%区域生长肿块分割
[Imass_p]=boundingBox(Igrow_p);%去除周围像素值为0的点，保留包含肿块区域的最小矩形
Igrow_n=immultiply(fliplr(logical(Igrow_p)),Ibreast);%肿块区域对应到对侧乳腺
[Imass_n]=boundingBox(Igrow_n);%保留最小矩形
%肿块分割结果
figure
for i=1:size(Imass_p,3)
    subplot(4,4,i),imshow( Imass_p(:,:,i),[]);
end
%单张显示
for i=1:size(Ibreast,3)
    figure
    imshow(Ibreast(:,:,i),[]);hold on;
   [c1,h1] =contour(logical(Igrow_p(:,:,i)),'r-');
end 
%保存肿块（Imass_p），对侧roi（Imass_n），原图像中的肿块掩模（Igrow_p）
 in=Imass_p;
 save(['E:\乳腺\我的程序\1数据\MR\DCE\输入腺体\原始\1\in_mr',num2str(p)],'in');
 in=Imass_n;
 save(['E:\乳腺\我的程序\1数据\MR\DCE\输入腺体\原始\2\in_mr',num2str(p)],'in');
 in=Igrow_p;
 save(['E:\乳腺\我的程序\1数据\MR\DCE\输入腺体\原始\grow\in_mr',num2str(p)],'in');
end

