clc;
close all;
clear all;
%恶性及良性样本的序号
malignent=[1,2,3,4,5,6,8,9,10,11,12,16,19,20,22,24,26,49,52,53,55,58,64,65,67,68,72,73,74,76,77,78,82,84,85];
benign=[7,17,18,27,28,29,30,31,33,34,35,36,38,39,40,41,42,43,44,45,47,48,54,57,59,60,61,63,88,90,94,97,99,100,101,108,110,111,115,117,120,121];
c_10=zeros(1,121),c_10(malignent)=1;%良性样本存储在文件夹0下，恶性样本存储在文件夹1下
fname='tic';
mode='DCE';
pp=[1:121];
pp([13,14,15,21,23,25,32,37,46,50,51,56,62,66,69,71,70,75,79,80,81,83,86,89,107,87,91,92,93,95,96,98,102,103,104,105,106,107,109,112,113,114,116,118,119 ])=[];
for p=pp
load(['E:\乳腺\我的程序\1数据\MR\',mode,'\输入腺体\原始\TIC_p\in_mr',num2str(p)]);
ff=tic1(val);%病灶侧TIC特征
b1=ff;
save([ 'E:\乳腺\我的程序\1数据\MR\',mode,'\',fname,'\肿块p\',num2str(c_10(p)),'\',num2str(p)],'ff');
load(['E:\乳腺\我的程序\1数据\MR\',mode,'\输入腺体\原始\TIC_n\in_mr',num2str(p)]);
ff=tic1(val);%对侧TIC特征
b2=ff;
save([ 'E:\乳腺\我的程序\1数据\MR\',mode,'\',fname,'\肿块n\',num2str(c_10(p)),'\',num2str(p)],'ff');
ff=abs(b1-b2);%两侧差
save([ 'E:\乳腺\我的程序\1数据\MR\',mode,'\',fname,'\肿块差\',num2str(c_10(p)),'\',num2str(p)],'ff');
end

%合并良性各病例/合并恶性各病例
for c1=[0,1]
c_10=zeros(1,121),c_10(malignent)=1;
if c1==1
        pp=malignent;
    else
       pp=benign;
    end
file{1}='肿块p';file{2}='肿块差';
for i1=1:2
    f=[];
   %pp([13,14,15,21,23,25,32,37,46,50,51,56,62,66,69,71,70,75,79,80,81,83,86,89,107,87,91,92,93,95,96,98,102,103,104,105,106,107,109,112,113,114,116,118,119 ])=[];
    for p=pp
    a1=load([ 'E:\乳腺\我的程序\1数据\MR\',mode,'\',fname,'\',file{i1},'\',num2str(c1),'\',num2str(p)]);
    a=a1.ff
    f=[f;a];
    end
     save([ 'E:\乳腺\我的程序\1数据\MR\',mode,'\',fname,'\',file{i1},'\',num2str(c1),'\zong1'],'f');
end   
end
