function out=tic1(val)
l=length(val);
    N=7;
    P=polyfit(1:9,val,N);
    L=1:0.01:9;
    C=polyval(P,L);%七次多项式拟合曲线
    for i=1:N
        D1(i)=P(i)*(N-i+1);%多项式一阶导参数
        D(i)=D1(i)*(N-i);%多项式二阶导参数
    end
    D2=D(1:N-1);
    
    T1=val(9)/val(1);%灰度比参数1
    T2=val(9)/val(2);%灰度比参数2
    T3=val(9)/val(3);%灰度比参数3
    T4=val(9)/val(4);%灰度比参数4
    T5=val(9)/val(5);%灰度比参数5
    T6=val(9)/val(6);%灰度比参数6
    T7=val(9)/val(7);%灰度比参数7
    T8=val(9)/val(8);%灰度比参数8
    T9=(val(4)-val(1))/val(1);%(对比剂代谢参数6)吸收率
    T10=(val(1)-val(9))/val(9);%(对比剂代谢参数7)廓清率
    T11=find(C==max(C))*0.01;%达峰时间
    T12=max(C);%浓度最大值
    T13=T12/T11;%峰值增强斜率
    t1=abs(polyval(D2,T11));
    t2=abs(polyval(P,T11));
    T14=t1*t2;%增强峰值曲率
    T15=P(1);%曲线拟合参数
    T16=P(2);%曲线拟合参数
    T17=P(3);%曲线拟合参数
    T18=P(4);%曲线拟合参数
    T19=P(5);%曲线拟合参数
    T20=P(6);%曲线拟合参数
    T21=P(7);%曲线拟合参数
    T22=P(8);%曲线拟合参数
    delte1=(val(2)-val(1))/val(1);
    delte2=(val(9)-val(1))/val(1);
    T23=delte1/delte2;%SER,信号增强比
    T24=(val(2)-val(1))/val(1);%初始增强百分比
    T25=(val(2)-val(1));%初始增强速率
    T26=(T12-val(1))/val(1);%最大增强百分比
    T27=(T12-val(1))/T11;%最大增强速率
    T28=(T12-val(9))/T11;%washout百分比
    T29=(T12-val(9))/(9-T11);%washout速率


    out=[T1 T2 T3 T4 T5 T6 T7 T8 T9 T10 T11 T12 T13 T14 T15 ...
        T16 T17 T18 T19 T20 T21 T22 T23 T24 T25 T26 T27 T28 T29 ];
end



% 1~8	灰度比参数(8)
% 9.00 	吸收率
% 10.00 	廓清率
% 11.00 	达峰时间
% 12.00 	浓度最大值
% 13.00 	峰值增强斜率
% 14.00 	峰值增强曲率
% 15~22	    曲线拟合参数(8)
% 23.00 	信号增强比
% 24.00 	初始增强百分比
% 25.00 	初始增强速率
% 26.00 	最大增强百分比
% 27.00 	最大增强速率
% 28.00 	流出百分比
% 29.00 	流出速率

